export const chainExplorer = {
  // btc: {
  //   address: "https://blockchair.com/bitcoin/address/",
  //   txid: "https://blockchair.com/bitcoin/transaction/",
  // },
  btc: {
    address: "https://mempool.space/address/",
    txid: "https://mempool.space/tx/",
  },
  eth: {
    ens: "https://rainbow.me/profile/",
    address: "https://etherscan.io/address/",
    txid: "https://etherscan.io/tx/",
  }
}

export const ensOrgUrl = "https://app.ens.domains/coin-society.eth";

export const CANDIDATE = "waiting for address";
export const ELIGIBLE_CANDIDATE = "candidate";

export const EMOJI_LIST = [
  '👨‍💻', '🌟', '🚀', '🎯', '🎨', '🎮', '🎸', '📚', '🎬', '🎭',
  '🎪', '🎢', '🎡', '🎠', '🌍', '🌎', '🌏', '🌐', '💫', '⭐️',
  '✨', '💥', '🔥', '🌈', '🌞', '🌙', '⚡️', '🍀', '🌺', '🌸',
  '🌼', '🌻', '🌹', '🌷', '🦁', '🐯', '🐼', '🦊', '🦄', '🐝',
  '🦋', '🐢', '🐬', '🦈', '🎵', '🎹', '🎺', '🎻', '🥁', '🎧',
  '🎤', '🎼', '🪘', '🪗', '⚙️', '🔧', '💡', '🔬', '🔭', '📡',
  '💻', '🖥️', '📱', '⌨️', '🎲', '🎳', '🕹️', '🌵', '🌴', '🌲',
  '🌳', '🍄', '🌿', '☘️', '🪴', '🎋', '🏃', '🚶', '🧗', '🏊',
  '🚴', '🤸', '🏋️', '🧘', '🤺', '🤾', '🦒', '🦘', '🦬', '🦣',
  '🦏', '🦛', '🐘', '🦔', '🦦', '🦥', '🌝', '🌚', '🌜', '☄️',
  '🌪️', '🏟️', '🏰', '🏯', '🏛️', '⛩️', '🕍', '🧠', '🫀', '🫁',
  '🦷', '🦴', '👀', '👂', '👃', '🦾', '🦿', '🤖', '👽', '👾',
  '🎪', '🎡', '🦭', '🦦', '🎨', '🎭', '🎃', '🗺️', '🗾', '🧭',
  '⚓', '🚢', '✈️', '📸', '📹', '📽️', '🎥', '📺', '📷', '🖼️',
  '♟️', '🧩', '🃏', '🌭', '🍔', '🍟', '🍕', '🌮', '🌯', '🥪',
  '🥙', '🧆', '🥘', '🏆', '🏅', '🎖️', '🤺', '⚽', '🏀', '🏈',
  '⚾', '🥎', '💎', '💍', '💄', '👑', '👒', '🎩', '🎓', '🧢',
  '⛑️', '📿', '🔮', '⚱️', '🏺', '💈', '⚗️', '🕯️', '🪔', '🦚',
  '🦜', '🦢', '🦩', '🦃', '🦅', '🦆', '🦉', '🐓', '🦤', '🐉',
  '🐲', '🎄', '🤹', '🧙', '🧚', '🧛', '🧜', '🧝', '🧞', '🧟',
  '🧌'
];